performanceTest.yml
---
execution:
    - concurrency: 20
      ramp-up: 30s
      hold-for: 2m
      scenario:
          think-time: 0.75
          requests:
              - <%= process.env.APP_NAME %>

modules: 
    blazemeter:
      token: 777b3198350434a55e0a
      browser-open: false
    console:
      disable: true
       
reporting: 
      - module: blazemeter
        test: Taurus in Bluemix
      - module: fail-criteria
        criterias: 
        - avg-rt>300ms for 10s, stop as failed
        - fail>50% for 10s, stop as failed